<a href="https://colab.research.google.com/github/shivendr7/ml/blob/main/GroupSortShuffleDataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import os
import pandas as pd
import numpy as np

df=pd.read_csv("https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",na_values=['NA','?'])

#reindexing df
df=df.reindex(np.random.permutation(df.index))

pd.set_option('display.max_columns',7)
pd.set_option('display.max_rows',5)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
132,25.0,4,140.0,...,74,1,chevrolet vega
181,33.0,4,91.0,...,75,3,honda civic cvcc
...,...,...,...,...,...,...,...
34,16.0,6,225.0,...,71,1,plymouth satellite custom
77,22.0,4,121.0,...,72,2,volkswagen 411 (sw)

In [6]:
#reseting indexes
pd.set_option('display.max_columns',7)
pd.set_option('display.max_rows',5)

df.reset_index(inplace=True,drop=True)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
0,25.0,4,140.0,...,74,1,chevrolet vega
1,33.0,4,91.0,...,75,3,honda civic cvcc
...,...,...,...,...,...,...,...
396,16.0,6,225.0,...,71,1,plymouth satellite custom
397,22.0,4,121.0,...,72,2,volkswagen 411 (sw)

In [11]:
import os
import pandas as pd

df=pd.read_csv("https://data.heatonresearch.com/data/t81-558/auto-mpg.csv",na_values=['NA','?'])

df=df.sort_values(by='cylinders',ascending=True)
#print(f"The first car is: {df['name'].iloc[0]}")

pd.set_option('display.max_columns',7)
pd.set_option('display.max_rows',5)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
111,18.0,3,70.0,...,73,3,maxda rx3
71,19.0,3,70.0,...,72,3,mazda rx2 coupe
...,...,...,...,...,...,...,...
92,13.0,8,351.0,...,73,1,ford ltd
0,18.0,8,307.0,...,70,1,chevrolet chevelle malibu

In [17]:
#grouping
g=df.groupby('cylinders')['mpg'].mean()
g

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [18]:
g.to_dict()

{3: 20.55,
 4: 29.28676470588236,
 5: 27.366666666666664,
 6: 19.98571428571429,
 8: 14.963106796116506}

In [27]:
df.groupby('cylinders')['origin'].mean()

cylinders
3    3.000000
4    1.985294
5    2.000000
6    1.190476
8    1.000000
Name: origin, dtype: float64

In [21]:
print(df.groupby('cylinders')['mpg'].count())
df.groupby('cylinders')['mpg'].count().to_dict()

cylinders
3      4
4    204
5      3
6     84
8    103
Name: mpg, dtype: int64

{3: 4, 4: 204, 5: 3, 6: 84, 8: 103}